Wratox/stm32h5xx-hal/src/spi.rs
    /// Specify the time in seconds that should be idled between every data word being sent.
    ///
    /// Note:
    /// * This value is converted to a number of spi peripheral clock ticks and at most 15 of those.
    #[must_use]
    pub fn inter_word_delay(mut self, inter_word_delay: f32) -> Self {
        self.inter_word_delay = inter_word_delay;
        self
    }

    /// Select the communication mode of the SPI bus.
    #[must_use]
    pub fn communication_mode(mut self, mode: CommunicationMode) -> Self {
        self.communication_mode = mode;
        self
    }
}

impl From<Mode> for Config {
    fn from(mode: Mode) -> Self {
        Self::new(mode)
    }
}

/// Object containing the settings for the hardware chip select pin
#[derive(Clone, Copy)]
pub struct HardwareCS {
    /// The value that determines the behaviour of the hardware chip select pin.
    pub mode: HardwareCSMode,
    /// The delay between CS assertion and the beginning of the SPI transaction in seconds.
    ///
    /// Note:
    /// * This value introduces a delay on SCK from the initiation of the transaction. The delay
    /// is specified as a number of SCK cycles, so the actual delay may vary.
    pub assertion_delay: f32,
    /// The polarity of the CS pin.
    pub polarity: Polarity,
}

#[derive(Debug, Clone, Copy)]
#[cfg_attr(feature = "defmt", derive(defmt::Format))]
pub enum HardwareCSMode {
    /// Handling the CS is left for the user to do in software
    Disabled,
    /// The CS will assert when the first data is sent and will not de-assert,
    /// unless manually done in software using [Spi::end_transaction].
    EndlessTransaction,
    /// The CS will assert and de-assert for each word being sent
    WordTransaction,
    /// The CS will assert and only de-assert after the whole frame is sent.
    ///
    /// When this mode is active, the blocking embedded hal interface automatically
    /// sets up the frames so it will be one frame per call.
    ///
    /// Note:
    /// * This mode does require some maintenance. Before sending, you must setup
    /// the frame with [Spi::setup_transaction]. After everything has been sent,
    /// you must also clean it up with [Spi::end_transaction].
    FrameTransaction,
}

impl HardwareCS {
    fn assertion_delay(&self) -> f32 {
        self.assertion_delay
    }

    fn polarity(&self) -> Polarity {
        self.polarity
    }

    fn enabled(&self) -> bool {
        !matches!(self.mode, HardwareCSMode::Disabled)
    }

    fn interleaved_cs(&self) -> bool {
        matches!(self.mode, HardwareCSMode::WordTransaction { .. })
    }
}

/// A filler type for when the SCK pin is unnecessary
pub struct NoSck;

/// A filler type for when the Miso pin is unnecessary
pub struct NoMiso;

/// A filler type for when the Mosi pin is unnecessary
pub struct NoMosi;

macro_rules! pins {
    ($($SPIX:ty:
       SCK: [$($( #[ $pmeta1:meta ] )* $SCK:ty),*]
       MISO: [$($( #[ $pmeta2:meta ] )* $MISO:ty),*]
       MOSI: [$($( #[ $pmeta3:meta ] )* $MOSI:ty),*]
       HCS: [$($( #[ $pmeta4:meta ] )* $HCS:ty),*]
    )+) => {
        $(
            $(
                $( #[ $pmeta1 ] )*
                impl PinSck<$SPIX> for $SCK {}
            )*
            $(
                $( #[ $pmeta2 ] )*
                impl PinMiso<$SPIX> for $MISO {}
            )*
            $(
                $( #[ $pmeta3 ] )*
                impl PinMosi<$SPIX> for $MOSI {}
            )*
            $(
                $( #[ $pmeta4 ] )*
                impl PinHCS<$SPIX> for $HCS {}
            )*
        )+
    }
}

// Note: pin data is taken from stm32h573 and stm32h523 datasheets
#[cfg(not(feature = "stm32h503"))]
pins! {
    SPI1:
        SCK: [
            NoSck,
            gpio::PA5<Alternate<5>>,
            gpio::PB3<Alternate<5>>,
            gpio::PG11<Alternate<5>>,
        ]
        MISO: [
            NoMiso,
            gpio::PA6<Alternate<5>>,
            gpio::PB4<Alternate<5>>,
            gpio::PG9<Alternate<5>>
        ]
        MOSI: [
            NoMosi,
            gpio::PA7<Alternate<5>>,
            gpio::PB5<Alternate<5>>,
            #[cfg(feature = "stm32h523")]
            gpio::PB15<Alternate<6>>,
            gpio::PD7<Alternate<5>>
        ]
        HCS: [
            gpio::PA4<Alternate<5>>,
            gpio::PA15<Alternate<5>>,
            gpio::PG10<Alternate<5>>
        ]
    SPI2:
        SCK: [
            NoSck,
            gpio::PA9<Alternate<5>>,
            gpio::PA12<Alternate<5>>,
            #[cfg(feature = "stm32h523")]
            gpio::PB3<Alternate<6>>,
            gpio::PB10<Alternate<5>>,
            gpio::PB13<Alternate<5>>,
            gpio::PD3<Alternate<5>>,
            #[cfg(feature = "stm32h573")]
            gpio::PI1<Alternate<5>>
        ]
        MISO: [
            NoMiso,
            gpio::PB14<Alternate<5>>,
            gpio::PC2<Alternate<5>>,
            #[cfg(feature = "stm32h573")]
            gpio::PI2<Alternate<5>>
        ]
        MOSI: [
            NoMosi,
            gpio::PB15<Alternate<5>>,
            gpio::PC1<Alternate<5>>,
            gpio::PC3<Alternate<5>>,
            gpio::PG1<Alternate<7>>,
            #[cfg(feature = "stm32h573")]
            gpio::PI3<Alternate<5>>
        ]
        HCS: [
            gpio::PA3<Alternate<5>>,
            gpio::PA11<Alternate<5>>,
            #[cfg(feature = "stm32h523")]
            gpio::PB1<Alternate<5>>,
            gpio::PB4<Alternate<7>>,
            gpio::PB9<Alternate<5>>,
            gpio::PB12<Alternate<5>>,
            #[cfg(feature = "stm32h573")]
            gpio::PI0<Alternate<5>>
        ]
    SPI3:
        SCK: [
            NoSck,
            #[cfg(feature = "stm32h523")]
            gpio::PB1<Alternate<4>>,
            gpio::PB3<Alternate<6>>,
            #[cfg(feature = "stm32h523")]
            gpio::PB9<Alternate<6>>,
            gpio::PC10<Alternate<6>>
        ]
        MISO: [
            NoMiso,
            #[cfg(feature = "stm32h523")]
            gpio::PB0<Alternate<5>>,
            gpio::PB4<Alternate<6>>,
            gpio::PC11<Alternate<6>>
            #[cfg(feature = "stm32h523")]
            gpio::PD7<Alternate<6>>
        ]
        MOSI: [
            NoMosi,
            #[cfg(feature = "stm32h523")]
            gpio::PA3<Alternate<6>>,
            #[cfg(feature = "stm32h523")]
            gpio::PA4<Alternate<4>>,
            gpio::PB2<Alternate<7>>,
            gpio::PB5<Alternate<7>>,
            gpio::PC12<Alternate<6>>,
            gpio::PD6<Alternate<5>>,
            #[cfg(feature = "stm32h523")]
            gpio::PG8<Alternate<5>>
        ]
        HCS: [
            gpio::PA4<Alternate<6>>,
            gpio::PA15<Alternate<6>>,
            #[cfg(feature = "stm32h523")]
            gpio::PB8<Alternate<6>>
        ]
    SPI4:
        SCK: [
            NoSck,
            #[cfg(feature = "stm32h523")]
            gpio::PA0<Alternate<5>>,
            #[cfg(feature = "stm32h523")]
            gpio::PA8<Alternate<6>>,
            #[cfg(feature = "stm32h523")]
            gpio::PC5<Alternate<6>>,
            gpio::PE2<Alternate<5>>,
            gpio::PE12<Alternate<5>>
        ]
        MISO: [
            NoMiso,
            #[cfg(feature = "stm32h523")]
            gpio::PC0<Alternate<6>>,
            #[cfg(feature = "stm32h523")]
            gpio::PB7<Alternate<5>>,
            gpio::PE5<Alternate<5>>,
            gpio::PE13<Alternate<5>>
        ]
        MOSI: [
            NoMosi,
            #[cfg(feature = "stm32h523")]
            gpio::PC1<Alternate<6>>,
            gpio::PE6<Alternate<5>>,
            gpio::PE14<Alternate<5>>
        ]
        HCS: [
            gpio::PE4<Alternate<5>>,
            gpio::PE11<Alternate<5>>
        ]
 
