Wratox/stm32h5xx-hal/src/spi.rs
}

#[cfg(feature = "stm32h573")]
pins! {
    SPI5:
    SCK: [
        NoSck,
        gpio::PF7<Alternate<5>>,
        gpio::PH6<Alternate<5>>,
    ]
    MISO: [
        NoMiso,
        gpio::PF8<Alternate<5>>,
        gpio::PH7<Alternate<5>>,
    ]
    MOSI: [
        NoMosi,
        gpio::PF9<Alternate<5>>,
        gpio::PF11<Alternate<5>>,
        gpio::PH8<Alternate<5>>
    ]
    HCS: [
        gpio::PF6<Alternate<5>>,
        gpio::PH5<Alternate<5>>,
        gpio::PH9<Alternate<5>>
    ]
SPI6:
    SCK: [
        NoSck,
        gpio::PA5<Alternate<8>>,
        gpio::PB3<Alternate<8>>,
        gpio::PC12<Alternate<5>>,
        gpio::PG13<Alternate<5>>
    ]
    MISO: [
        NoMiso,
        gpio::PA6<Alternate<8>>,
        gpio::PB4<Alternate<8>>,
        gpio::PG12<Alternate<5>>
    ]
    MOSI: [
        NoMosi,
        gpio::PA7<Alternate<8>>,
        gpio::PB5<Alternate<8>>,
        gpio::PG14<Alternate<5>>
    ]
    HCS: [
        gpio::PA0<Alternate<5>>,
        gpio::PA4<Alternate<8>>,
        gpio::PA15<Alternate<7>>,
        gpio::PG8<Alternate<5>>
    ]
}

macro_rules! check_status_error {
    ($spi:expr; $(  {$flag:ident, $variant:ident, $blk:block}  ),*) => {{
        let sr = $spi.sr().read();

        return Err(if sr.ovr().is_overrun() {
            nb::Error::Other(Error::Overrun)
        } else if sr.modf().is_fault() {
            nb::Error::Other(Error::ModeFault)
        } else if sr.crce().is_error() {
            nb::Error::Other(Error::Crc)
        }
            $(
                else if sr.$flag().$variant() { $blk }
            )*
        else {
            nb::Error::WouldBlock
        })
    }}
}

/// Interrupt events
#[derive(Copy, Clone, PartialEq, Eq)]
pub enum Event {
    /// New data has been received
    Rxp,
    /// Data can be sent
    Txp,
    /// An error occurred
    Error,
}

#[derive(Debug)]
pub struct Spi<SPI, ED, WORD = u8> {
    spi: SPI,
    hardware_cs_mode: HardwareCSMode,
    _word: PhantomData<WORD>,
    _ed: PhantomData<ED>,
}

pub trait SpiExt<SPI, WORD>: Sized {
    type Rec: ResetEnable;

    fn spi<PINS, CONFIG>(
        self,
        _pins: PINS,
        config: CONFIG,
        freq: Hertz,
        prec: Self::Rec,
        clocks: &CoreClocks,
    ) -> Spi<SPI, Enabled, WORD>
    where
        PINS: Pins<SPI>,
        CONFIG: Into<Config>;

    fn spi_unchecked<CONFIG>(
        self,
        config: CONFIG,
        freq: Hertz,
        prec: Self::Rec,
        clocks: &CoreClocks,
    ) -> Spi<SPI, Enabled, WORD>
    where
        CONFIG: Into<Config>;
}

pub trait HalEnabledSpi: HalSpi // + FullDuplex<Self::Word, Error = Error>
{
    type Disabled: HalDisabledSpi<
        Spi = Self::Spi,
        Word = Self::Word,
        Enabled = Self,
    >;

    /// Disables the SPI peripheral. Any SPI operation is
    /// stopped and disabled, the internal state machine is
    /// reset, all the FIFOs content is flushed, the MODF
    /// flag is cleared, the SSI flag is cleared, and the
    /// CRC calculation is re-initialized. Clocks are not
    /// disabled.
    fn disable(self) -> Self::Disabled;

    /// Resets the SPI peripheral.
    fn reset(&mut self);

    /// Sets up a frame transaction with the given amount of data words.
    ///
    /// If this is called when the hardware CS mode is not [HardwareCSMode::FrameTransaction],
    /// then an error is returned with [Error::InvalidCall].
    ///
    /// If this is called when a transaction has already started,
    /// then an error is returned with [Error::TransactionAlreadyStarted].
    fn setup_transaction(
        &mut self,
        words: core::num::NonZeroU16,
    ) -> Result<(), Error>;

    /// Ends the current transaction, both for endless and frame transactions.
    ///
    /// This method must always be called for frame transaction,
    /// even if the full size has been sent. If this is not done,
    /// no new data can be sent even when it looks like it should.
    ///
    /// If it's not either a frame or endless transaction,
    /// an error is returned with [Error::InvalidCall].
    fn end_transaction(&mut self) -> Result<(), Error>;
}

pub trait HalDisabledSpi: HalSpi {
    type Rec;
    type Enabled: HalEnabledSpi<Spi = Self::Spi, Word = Self::Word>;

    /// Enables the SPI peripheral.
    /// Clears the MODF flag, the SSI flag, and sets the SPE bit.
    fn enable(self) -> Self::Enabled;

    /// Enables the Rx DMA stream. If the DMA Rx is used, the
    /// reference manual recommends that this is enabled before
    /// enabling the DMA
    fn enable_dma_rx(&mut self);

    fn disable_dma_rx(&mut self);

    /// Enables the Tx DMA stream. If the DMA Tx is used, the
    /// reference manual recommends that this is enabled after
    /// enabling the DMA
    fn enable_dma_tx(&mut self);

    fn disable_dma_tx(&mut self);

    /// Deconstructs the SPI peripheral and returns the component parts.
    fn free(self) -> (Self::Spi, Self::Rec);
}

pub trait HalSpi: Sized {
    type Spi;
    type Word;

    /// Returns a mutable reference to the inner peripheral
    fn inner(&self) -> &Self::Spi;

    /// Returns a mutable reference to the inner peripheral
    fn inner_mut(&mut self) -> &mut Self::Spi;

    /// Enable interrupts for the given `event`:
    ///  - Received data ready to be read (RXP)
    ///  - Transmit data register empty (TXP)
    ///  - Error
    fn listen(&mut self, event: Event);

    /// Disable interrupts for the given `event`:
    ///  - Received data ready to be read (RXP)
    ///  - Transmit data register empty (TXP)
    ///  - Error
    fn unlisten(&mut self, event: Event);

    /// Return `true` if the TXP flag is set, i.e. new
    /// data to transmit can be written to the SPI.
    fn is_txp(&self) -> bool;

    /// Return `true` if the RXP flag is set, i.e. new
    /// data has been received and can be read from the
    /// SPI.
    fn is_rxp(&self) -> bool;

    /// Return `true` if the MODF flag is set, i.e. the
    /// SPI has experienced a mode fault
    fn is_modf(&self) -> bool;

