Wratox/stm32h5xx-hal/src/spi.rs
                impl <Ed> Spi<$SPIX, Ed, $TY> {
                    /// internally disable the SPI without changing its type-state
                    fn internal_disable(&mut self) {
                        self.spi.cr1().modify(|_, w| w.csusp().requested());
                        while self.spi.sr().read().eot().is_completed() {}
                        self.spi.cr1().write(|w| w.ssi().slave_not_selected().spe().disabled());
                    }

                    /// internally enable the SPI without changing its type-state
                    fn internal_enable(&mut self) {
                        self.clear_modf(); // SPE cannot be set when MODF is set
                        self.spi.cr1().write(|w| w.ssi().slave_not_selected().spe().enabled());
                    }
                }

                impl HalEnabledSpi for Spi<$SPIX, Enabled, $TY> {
                    type Disabled = Spi<Self::Spi, Disabled, Self::Word>;

                    fn reset(&mut self) {
                        self.internal_disable();
                        self.internal_enable();
                    }

                    fn disable(mut self) -> Spi<$SPIX, Disabled, $TY> {
                        // Master communication must be suspended before the peripheral is disabled
                        self.internal_disable();

                        Spi {
                            spi: self.spi,
                            hardware_cs_mode: self.hardware_cs_mode,
                            _word: PhantomData,
                            _ed: PhantomData,
                        }
                    }

                    fn setup_transaction(&mut self, words: core::num::NonZeroU16) -> Result<(), Error> {
                        if !matches!(self.hardware_cs_mode, HardwareCSMode::FrameTransaction) {
                            return Err(Error::InvalidCall);
                        }

                        if self.spi.cr1().read().cstart().is_started() {
                            return Err(Error::TransactionAlreadyStarted);
                        }

                        // We can only set tsize when spi is disabled
                        self.spi.cr1().modify(|_, w| w.csusp().requested());
                        while self.spi.sr().read().eot().is_completed() {}
                        self.spi.cr1().write(|w| w.ssi().slave_not_selected().spe().disabled());

                        // Set the frame size
                        self.spi.cr2().write(|w| w.tsize().set(words.get()));

                        // Re-enable
                        self.clear_modf(); // SPE cannot be set when MODF is set
                        self.spi.cr1().write(|w| w.ssi().slave_not_selected().spe().enabled());

                        Ok(())
                    }

                    fn end_transaction(&mut self) -> Result<(), Error> {
                        if !matches!(self.hardware_cs_mode, HardwareCSMode::FrameTransaction | HardwareCSMode::EndlessTransaction) {
                            return Err(Error::InvalidCall);
                        }

                        self.spi.cr1().modify(|_, w| w.csusp().requested());
                        while(self.spi.cr1().read().cstart().is_started()) {}

                        self.spi.ifcr().write(|w| w.txtfc().clear().eotc().clear());

                        Ok(())
                    }
                }

                impl HalDisabledSpi for Spi<$SPIX, Disabled, $TY> {
                    type Rec = rec::$Rec;
                    type Enabled = Spi<Self::Spi, Enabled, Self::Word>;

                    fn enable(mut self) -> Self::Enabled {
                        self.internal_enable();
                        Spi {
                            spi: self.spi,
                            hardware_cs_mode: self.hardware_cs_mode,
                            _word: PhantomData,
                            _ed: PhantomData,
                        }
                    }

                    fn enable_dma_rx(&mut self) {
                        self.spi.cfg1().modify(|_,w| w.rxdmaen().enabled());
                    }

                    fn disable_dma_rx(&mut self) {
                        self.spi.cfg1().modify(|_,w| w.rxdmaen().disabled());
                    }

                    fn enable_dma_tx(&mut self) {
                        self.spi.cfg1().modify(|_,w| w.txdmaen().enabled());
                    }

                    fn disable_dma_tx(&mut self) {
                        self.spi.cfg1().modify(|_,w| w.txdmaen().disabled());
                    }

                    fn free(self) -> ($SPIX, rec::$Rec) {
                        (self.spi, rec::$Rec { _marker: PhantomData })
                    }
                }

                impl<EN> HalSpi for Spi<$SPIX, EN, $TY>
                {
                    type Word = $TY;
                    type Spi = $SPIX;

                    /// Returns a reference to the inner peripheral
                    fn inner(&self) -> &Self::Spi {
                        &self.spi
                    }

                    /// Returns a mutable reference to the inner peripheral
                    fn inner_mut(&mut self) -> &mut Self::Spi {
                        &mut self.spi
                    }

                    /// Enable interrupts for the given `event`:
                    ///  - Received data ready to be read (RXP)
                    ///  - Transmit data register empty (TXP)
                    ///  - Error
                    fn listen(&mut self, event: Event) {
                        match event {
                            Event::Rxp => self.spi.ier().modify(|_, w|
                                                              w.rxpie().not_masked()),
                            Event::Txp => self.spi.ier().modify(|_, w|
                                                              w.txpie().not_masked()),
                            Event::Error => self.spi.ier().modify(|_, w| {
                                w.udrie() // Underrun
                                    .not_masked()
                                    .ovrie() // Overrun
                                    .not_masked()
                                    .crceie() // CRC error
                                    .not_masked()
                                    .modfie() // Mode fault
                                    .not_masked()
                            }),
                        };
                    }

