Wratox/stm32h5xx-hal/src/spi.rs
                    /// Disable interrupts for the given `event`:
                    ///  - Received data ready to be read (RXP)
                    ///  - Transmit data register empty (TXP)
                    ///  - Error
                    fn unlisten(&mut self, event: Event) {
                        match event {
                            Event::Rxp => {
                                self.spi.ier().modify(|_, w| w.rxpie().masked());
                            }
                            Event::Txp => {
                                self.spi.ier().modify(|_, w| w.txpie().masked());
                            }
                            Event::Error => {
                                self.spi.ier().modify(|_, w| {
                                    w.udrie() // Underrun
                                        .masked()
                                        .ovrie() // Overrun
                                        .masked()
                                        .crceie() // CRC error
                                        .masked()
                                        .modfie() // Mode fault
                                        .masked()
                                });
                            }
                        }
                        let _ = self.spi.ier().read();
                        let _ = self.spi.ier().read(); // Delay 2 peripheral clocks
                    }

                    /// Return `true` if the TXP flag is set, i.e. new
                    /// data to transmit can be written to the SPI.
                    fn is_txp(&self) -> bool {
                        self.spi.sr().read().txp().is_not_full()
                    }

                    /// Return `true` if the RXP flag is set, i.e. new
                    /// data has been received and can be read from the
                    /// SPI.
                    fn is_rxp(&self) -> bool {
                        self.spi.sr().read().rxp().is_not_empty()
                    }

                    /// Return `true` if the MODF flag is set, i.e. the
                    /// SPI has experienced a mode fault
                    fn is_modf(&self) -> bool {
                        self.spi.sr().read().modf().is_fault()
                    }

                    /// Return `true` if the OVR flag is set, i.e. new
                    /// data has been received while the receive data
                    /// register was already filled.
                    fn is_ovr(&self) -> bool {
                        self.spi.sr().read().ovr().is_overrun()
                    }

                    /// Clears the MODF flag, which indicates that a
                    /// mode fault has occurred.
                    fn clear_modf(&mut self) {
                        self.spi.ifcr().write(|w| w.modfc().clear());
                        let _ = self.spi.sr().read();
                        let _ = self.spi.sr().read(); // Delay 2 peripheral clocks
                    }
                }

                impl SpiExt<$SPIX, $TY> for $SPIX {
                    type Rec = rec::$Rec;

	                fn spi<PINS, CONFIG>(self,
                                    _pins: PINS,
                                    config: CONFIG,
                                    freq: Hertz,
                                    prec: rec::$Rec,
                                    clocks: &CoreClocks) -> Spi<$SPIX, Enabled, $TY>
	                where
	                    PINS: Pins<$SPIX>,
                        CONFIG: Into<Config>,
	                {
                        let config = config.into();
                        assert_eq!(
                            config.hardware_cs.enabled(),
                            PINS::HCS_PRESENT,
                            "If the hardware cs is enabled in the config, an HCS pin must be present in the given pins"
                        );
	                    Spi::<$SPIX, Enabled, $TY>::$spiX(self, config, freq, prec, clocks)
	                }

	                fn spi_unchecked<CONFIG>(self,
                                        config: CONFIG,
                                        freq: Hertz,
                                        prec: rec::$Rec,
                                        clocks: &CoreClocks) -> Spi<$SPIX, Enabled, $TY>
	                where
                        CONFIG: Into<Config>,
	                {
	                    Spi::<$SPIX, Enabled, $TY>::$spiX(self, config, freq, prec, clocks)
	                }
	            }

                impl Spi<$SPIX, Enabled, $TY> {
                    /// Reads the word stored in the shift register.
                    ///
                    /// NOTE: A word must be sent to the slave before attempting
                    /// to call this method
                    pub fn read(&mut self) -> nb::Result<$TY, Error> {
                        check_status_error!(self.spi;
                        {    // } else if sr.rxp().is_not_empty() {
                            rxp, is_not_empty,
                            {
                                // NOTE(read_volatile) read only 1 word
                                return Ok(unsafe {
                                    ptr::read_volatile(
                                        &self.spi.rxdr() as *const _ as *const $TY,
                                    )
                                });
                            }
                        })
                    }

                    /// Sends a word to the slave
                    pub fn send(&mut self, word: $TY) -> nb::Result<(), Error> {
                        check_status_error!(self.spi;
                        {    // } else if sr.txp().is_not_full() {
                            txp, is_not_full,
                            {
                                // NOTE(write_volatile) see note above
                                unsafe {
                                    let txdr = &self.spi.txdr() as *const _ as *const UnsafeCell<$TY>;
                                    ptr::write_volatile(
                                        UnsafeCell::raw_get(txdr),
                                        word,
                                    )
                                }
                                // write CSTART to start a transaction in
                                // master mode
                                self.spi.cr1().modify(|_, w| w.cstart().started());

