Wratox/stm32h5xx-hal/src/spi.rs
                                return Ok(());
                            }
                        })
                    }
                }

                impl Spi<$SPIX, Enabled, $TY>
                {
                    /// Internal implementation for exchanging a word
                    ///
                    /// * Assumes the transaction has started (CSTART handled externally)
                    /// * Assumes at least one word has already been written to the Tx FIFO
                    #[inline(always)]
                    fn exchange_duplex_internal(&mut self, word: $TY) -> nb::Result<$TY, Error> {
                        check_status_error!(self.spi;
                        {    // else if sr.dxp().is_available() {
                            dxp, is_available,
                            {
                                // NOTE(write_volatile/read_volatile) write/read only 1 word
                                unsafe {
                                    let txdr = &self.spi.txdr() as *const _ as *const UnsafeCell<$TY>;
                                    ptr::write_volatile(
                                        UnsafeCell::raw_get(txdr),
                                        word,
                                    );
                                    return Ok(ptr::read_volatile(
                                        &self.spi.rxdr() as *const _ as *const $TY,
                                    ));
                                }
                            }
                        }, { // else if sr.txc().is_completed() {
                            txc, is_completed,
                            {
                                let sr = self.spi.sr().read(); // Read SR again on a subsequent PCLK cycle

                                if sr.txc().is_completed() && !sr.rxp().is_not_empty() {
                                    // The Tx FIFO completed, but no words were
                                    // available in the Rx FIFO. This is a duplex failure
                                    nb::Error::Other(Error::DuplexFailed)
                                } else {
                                    nb::Error::WouldBlock
                                }
                            }
                        })
                    }
                    /// Internal implementation for reading a word
                    ///
                    /// * Assumes the transaction has started (CSTART handled externally)
                    /// * Assumes at least one word has already been written to the Tx FIFO
                    #[inline(always)]
                    fn read_duplex_internal(&mut self) -> nb::Result<$TY, Error> {
                        check_status_error!(self.spi;
                        {    // else if sr.rxp().is_not_empty()
                            rxp, is_not_empty,
                            {
                                // NOTE(read_volatile) read only 1 word
                                return Ok(unsafe {
                                    ptr::read_volatile(
                                        &self.spi.rxdr() as *const _ as *const $TY,
                                    )
                                });
                            }
                        }, { // else if sr.txc().is_completed()
                            txc, is_completed,
                            {
                                let sr = self.spi.sr().read(); // Read SR again on a subsequent PCLK cycle

                                if sr.txc().is_completed() && !sr.rxp().is_not_empty() {
                                    // The Tx FIFO completed, but no words were
                                    // available in the Rx FIFO. This is a duplex failure
                                    nb::Error::Other(Error::DuplexFailed)
                                } else {
                                    nb::Error::WouldBlock
                                }
                            }
                        })
                    }

                    /// Internal implementation for ensuring the current
                    /// transaction is completed
                    #[inline(always)]
                    fn flush(&mut self) -> Result<(), Error> {
                        while self.spi.sr().read().eot().is_completed() {}
                        Ok(())
                    }

                    /// Internal implementation for Write-only transfers
                    fn transfer_internal_w(&mut self, write_words: &[$TY]) -> Result<(), Error> {
                        // both buffers are the same length
                        if write_words.is_empty() {
                            return Ok(());
                        }

                        // Are we in frame mode?
                        if matches!(self.hardware_cs_mode, HardwareCSMode::FrameTransaction) {
                            const MAX_WORDS: usize = 0xFFFF;

                            // Can we send
                            if write_words.len() > MAX_WORDS {
                                return Err(Error::BufferTooBig { max_size: MAX_WORDS });
                            }

                            // Setup that we're going to send this amount of bits
                            // SAFETY: We already checked that `write_words` is not empty
                            self.setup_transaction(unsafe {
                                core::num::NonZeroU16::new_unchecked(write_words.len() as u16)
                            })?;
                        }

                        // Depth of FIFO to use. All current SPI implementations
                        // have a FIFO depth of at least 8 (see RM0433 Rev 7
                        // Table 409.) but pick 4 as a conservative value.
                        const FIFO_WORDS: usize = 4;

                        // Fill the first half of the write FIFO
                        let len = write_words.len();
                        let mut write = write_words.iter();
                        for _ in 0..core::cmp::min(FIFO_WORDS, len) {
                            nb::block!(self.send(*write.next().unwrap()))?;
                        }

                        // Continue filling write FIFO and emptying read FIFO
                        for word in write {
                            let _ = nb::block!(
                                self.exchange_duplex_internal(*word)
                            )?;
                        }

                        // Dummy read from the read FIFO
                        for _ in 0..core::cmp::min(FIFO_WORDS, len) {
                            let _ = nb::block!(self.read_duplex_internal())?;
                        }

