Wratox/stm32h5xx-hal/src/spi.rs
                        // Are we in frame mode?
                        if matches!(self.hardware_cs_mode, HardwareCSMode::FrameTransaction) {
                            // Clean up
                            self.end_transaction()?;
                        }

                        Ok(())
                    }

                    /// Internal implementation for Read Write transfers
                    fn transfer_internal_rw(&mut self, read: &mut [$TY], write: &[$TY])
                                            -> Result<(), Error> {
                        if read.is_empty() | write.is_empty() {
                            return Ok(());
                        }
                        let len = core::cmp::max(read.len(), write.len());

                        // Are we in frame mode?
                        if matches!(self.hardware_cs_mode, HardwareCSMode::FrameTransaction) {
                            const MAX_WORDS: usize = 0xFFFF;

                            // Can we send
                            if len > MAX_WORDS {
                                return Err(Error::BufferTooBig { max_size: MAX_WORDS });
                            }

                            // Setup that we're going to send this amount of bits
                            // SAFETY: We already checked that `write_words` is not empty
                            self.setup_transaction(unsafe {
                                core::num::NonZeroU16::new_unchecked(len as u16)
                            })?;
                        }

                        // Depth of FIFO to use. All current SPI implementations
                        // have a FIFO depth of at least 8 (see RM0433 Rev 7
                        // Table 409.) but pick 4 as a conservative value.
                        const FIFO_WORDS: usize = 4;

                        // Fill the first half of the write FIFO
                        let mut write = write.into_iter();
                        for _ in 0..core::cmp::min(FIFO_WORDS, len) {
                            nb::block!(self.send(*write.next().unwrap_or(&0xFF)))?;
                        }

                        for i in FIFO_WORDS..len+FIFO_WORDS {
                            let read_value = if i < len {
                                // Continue filling write FIFO and emptying read FIFO
                                nb::block!(
                                    self.exchange_duplex_internal(*write.next().unwrap_or(&0xFF))
                                )?
                            } else {
                                // Finish emptying the read FIFO
                                nb::block!(self.read_duplex_internal())?
                            };
                            if i - FIFO_WORDS < read.len() {
                                read[i - FIFO_WORDS] = read_value;
                            }
                        }

                        // Are we in frame mode?
                        if matches!(self.hardware_cs_mode, HardwareCSMode::FrameTransaction) {
                            // Clean up
                            self.end_transaction()?;
                        }

                        Ok(())
                    }

                    /// Internal implementation for in-place transfers
                    fn transfer_internal_in_place(&mut self, words : &mut [$TY]) -> Result<(), Error> {
                        if words.is_empty() {
                            return Ok(());
                        }

                        // Are we in frame mode?
                        if matches!(self.hardware_cs_mode, HardwareCSMode::FrameTransaction) {
                            const MAX_WORDS: usize = 0xFFFF;

                            // Can we send
                            if words.len() > MAX_WORDS {
                                return Err(Error::BufferTooBig { max_size: MAX_WORDS });
                            }

                            // Setup that we're going to send this amount of bits
                            // SAFETY: We already checked that `write_words` is not empty
                            self.setup_transaction(unsafe {
                                core::num::NonZeroU16::new_unchecked(words.len() as u16)
                            })?;
                        }

                        // Depth of FIFO to use. All current SPI implementations
                        // have a FIFO depth of at least 8 (see RM0433 Rev 7
                        // Table 409.) but pick 4 as a conservative value.
                        const FIFO_WORDS: usize = 4;

                        // Fill the first half of the write FIFO
                        let len = words.len();
                        for i in 0..core::cmp::min(FIFO_WORDS, len) {
                            nb::block!(self.send(words[i]))?;
                        }

                        for i in FIFO_WORDS..len+FIFO_WORDS {
                            if i < len {
                                // Continue filling write FIFO and emptying read FIFO
                                let read_value = nb::block!(
                                    self.exchange_duplex_internal(words[i])
                                )?;

                                words[i - FIFO_WORDS] = read_value;
                            } else {
                                // Finish emptying the read FIFO
                                words[i - FIFO_WORDS] = nb::block!(self.read_duplex_internal())?;
                            }
                        }

                        // Are we in frame mode?
                        if matches!(self.hardware_cs_mode, HardwareCSMode::FrameTransaction) {
                            // Clean up
                            self.end_transaction()?;
                        }

                        Ok(())
                    }
                }

                impl embedded_hal::spi::ErrorType for Spi<$SPIX, Enabled, $TY> {
                    type Error = Error;
                }
                impl embedded_hal::spi::SpiBus<$TY> for Spi<$SPIX, Enabled, $TY> {
                    fn write(&mut self, words: &[$TY]) -> Result<(), Self::Error> {
                        self.transfer_internal_w(words)
                    }
                    fn read(&mut self, words: &mut [$TY]) -> Result<(), Self::Error> {
                        self.transfer_internal_rw(words, &[])
                    }
                    fn transfer(&mut self, read: &mut [$TY], write: &[$TY]) -> Result<(), Self::Error> {
                        self.transfer_internal_rw(read, write)
                    }
                    fn transfer_in_place(&mut self, words: &mut [$TY]) -> Result<(), Self::Error> {
                        self.transfer_internal_in_place(words)
                    }
                    fn flush(&mut self) -> Result<(), Self::Error> {
                        self.flush()
                    }
                }
            )+
        )+
	}
}

macro_rules! spi123sel {
	($($SPIX:ident,)+) => {
	    $(
            impl<WORD> Spi<$SPIX, Enabled, WORD> {
                /// Returns the frequency of the current kernel clock
                /// for SPI1, SPI2, SPI3
                pub fn kernel_clk(clocks: &CoreClocks) -> Option<Hertz> {
                    let ccipr3 = unsafe { (*stm32::RCC::ptr()).ccipr3().read() };

                    match ccipr3.spi123sel().variant() {
                        Some(ccipr3::SPI123SEL::Pll1Q) => clocks.pll1_q_ck(),
                        Some(ccipr3::SPI123SEL::Pll2P) => clocks.pll2_p_ck(),
                        Some(ccipr3::SPI123SEL::Pll3P) => clocks.pll3_p_ck(),
                        // Need a method of specifying pin clock
                        Some(ccipr3::SPI123SEL::I2sCkin) => unimplemented!(),
                        Some(ccipr3::SPI123SEL::Per) => clocks.per_ck(),
                        _ => unreachable!(),
                    }
                }
                /// Returns the frequency of the current kernel clock
                /// for SPI1, SPI2, SPI3
                ///
                /// # Panics
                ///
                /// Panics if the kernel clock is not running
                pub fn kernel_clk_unwrap(clocks: &CoreClocks) -> Hertz {
                    let ccipr3 = unsafe { (*stm32::RCC::ptr()).ccipr3.read() };

                    match ccipr3.spi123sel().variant() {
                        Some(ccipr3::SPI123SEL::Pll1Q) => {
                            clocks.pll1_q_ck().expect("SPI123: PLL1_Q must be enabled")
                        }
                        Some(ccipr3::SPI123SEL::Pll2P) => {
                            clocks.pll2_p_ck().expect("SPI123: PLL2_P must be enabled")
                        }
                        Some(ccipr3::SPI123SEL::Pll3P) => {
                            clocks.pll3_p_ck().expect("SPI123: PLL3_P must be enabled")
                        }
                        // Need a method of specifying pin clock
                        Some(ccipr3::SPI123SEL::I2sCkin) => unimplemented!(),
                        Some(ccipr3::SPI123SEL::Per) => {
                            clocks.per_ck().expect("SPI123: PER clock must be enabled")
                        }
                        _ => unreachable!(),
                    }
                }
            }
        )+
    }
}
fn foo() {
    let ccipr3 = unsafe { (*stm32::RCC::ptr()).ccipr3().read() };
    //ccipr3::
}
// TODO: Do this for spi5sel, note that spi5sel uses pclk3 instead of pclk2
macro_rules! spi46sel {
	($($SPIX:ident,)+) => {
	    $(
            impl<WORD> Spi<$SPIX, Enabled, WORD> {
                /// Returns the frequency of the current kernel clock
                /// for SPI4, SPI5
                pub fn kernel_clk(clocks: &CoreClocks) -> Option<Hertz> {
                    let ccipr3 = unsafe { (*stm32::RCC::ptr()).ccipr3.read() };

                    match ccipr3.spi4sel().variant() {
                        Some(ccipr3::SPI456SEL::Apb) => Some(clocks.pclk2()),
                        Some(ccipr3::SPI456SEL::Pll2Q) => clocks.pll2_q_ck(),
                        Some(ccipr3::SPI456SEL::Pll3Q) => clocks.pll3_q_ck(),
                        Some(ccipr3::SPI456SEL::HsiKer) => clocks.hsi_ck(),
                        Some(ccipr3::SPI456SEL::CsiKer) => clocks.csi_ck(),
                        Some(ccipr3::SPI456SEL::Hse) => clocks.hse_ck(),
                        _ => unreachable!(),
                    }
                }
                /// Returns the frequency of the current kernel clock
                /// for SPI4, SPI5
                ///
                /// # Panics
                ///
                /// Panics if the kernel clock is not running
                pub fn kernel_clk_unwrap(clocks: &CoreClocks) -> Hertz {
                    let ccipr3 = unsafe { (*stm32::RCC::ptr()).ccipr3.read() };

                    match ccipr3.spi45sel().variant() {
                        Some(ccipr3::SPI45SEL::Apb) => clocks.pclk2(),
                        Some(ccipr3::SPI45SEL::Pll2Q) => {
                            clocks.pll2_q_ck().expect("SPI45: PLL2_Q must be enabled")
                        }
                        Some(ccipr3::SPI45SEL::Pll3Q) => {
                            clocks.pll3_q_ck().expect("SPI45: PLL3_Q must be enabled")
                        }
                        Some(ccipr3::SPI45SEL::HsiKer) => {
                            clocks.hsi_ck().expect("SPI45: HSI clock must be enabled")
                        }
                        Some(ccipr3::SPI45SEL::CsiKer) => {
                            clocks.csi_ck().expect("SPI45: CSI clock must be enabled")
                        }
                        Some(ccipr3::SPI45SEL::Hse) => {
                            clocks.hse_ck().expect("SPI45: HSE clock must be enabled")
                        }
                        _ => unreachable!(),
                    }
                }
            }
        )+
    }
}
macro_rules! spi6sel {
	($($SPIX:ident,)+) => {
	    $(
            impl<WORD> Spi<$SPIX, Enabled, WORD> {
                /// Returns the frequency of the current kernel clock
                /// for SPI6
                pub fn kernel_clk(clocks: &CoreClocks) -> Option<Hertz> {
                    let ccipr3 = unsafe { (*stm32::RCC::ptr()).ccipr3.read() };

