Wratox/stm32h5xx-hal/src/spi.rs
                    match ccipr3.spi6sel().variant() {
                        Some(ccipr3::SPI6SEL::RccPclk4) => Some(clocks.pclk4()),
                        Some(ccipr3::SPI6SEL::Pll2Q) => clocks.pll2_q_ck(),
                        Some(ccipr3::SPI6SEL::Pll3Q) => clocks.pll3_q_ck(),
                        Some(ccipr3::SPI6SEL::HsiKer) => clocks.hsi_ck(),
                        Some(ccipr3::SPI6SEL::CsiKer) => clocks.csi_ck(),
                        Some(ccipr3::SPI6SEL::Hse) => clocks.hse_ck(),
                        _ => unreachable!(),
                    }
                }
                /// Returns the frequency of the current kernel clock
                /// for SPI6
                pub fn kernel_clk_unwrap(clocks: &CoreClocks) -> Hertz {
                    let ccipr3 = unsafe { (*stm32::RCC::ptr()).ccipr3.read() };

                    match ccipr3.spi6sel().variant() {
                        Some(ccipr3::SPI6SEL::RccPclk4) => clocks.pclk4(),
                        Some(ccipr3::SPI6SEL::Pll2Q) => {
                            clocks.pll2_q_ck().expect("SPI6: PLL2_Q must be enabled")
                        }
                        Some(ccipr3::SPI6SEL::Pll3Q) => {
                            clocks.pll3_q_ck().expect("SPI6: PLL3_Q must be enabled")
                        }
                        Some(ccipr3::SPI6SEL::HsiKer) => {
                            clocks.hsi_ck().expect("SPI6: HSI clock must be enabled")
                        }
                        Some(ccipr3::SPI6SEL::CsiKer) => {
                            clocks.csi_ck().expect("SPI6: CSI clock must be enabled")
                        }
                        Some(ccipr3::SPI6SEL::Hse) => {
                            clocks.hse_ck().expect("SPI6: HSE clock must be enabled")
                        }
                        _ => unreachable!(),
                    }
                }
            }
        )+
    }
}

spi! {
    SPI1: (spi1, Spi1, pclk2) => (u8, u16, u32),
    SPI2: (spi2, Spi2, pclk1) => (u8, u16, u32),
    SPI3: (spi3, Spi3, pclk1) => (u8, u16, u32),
    SPI4: (spi4, Spi4, pclk2) => (u8, u16, u32),
    SPI5: (spi5, Spi5, pclk2) => (u8, u16, u32),
    SPI6: (spi6, Spi6, pclk2) => (u8, u16, u32),
}

spi123sel! {
    SPI1, SPI2, SPI3,
}
spi45sel! {
    SPI4, SPI5,
}
spi6sel! {
    SPI6,
}